# CutStyle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..CutStyle Property
ColumnAttachment Class See Also
---
Identifies whether the column, or the attached element should be cut (or if neither should be cut).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ColumnAttachmentCutStyle CutStyle { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutStyle As ColumnAttachmentCutStyle
	Get
```

Visual C++
---
```text
public:
property ColumnAttachmentCutStyle CutStyle {
	ColumnAttachmentCutStyle get ();
}
```

# See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace